PX4/PX4-Autopilot/nuttx/arch/arm/src/lm3s/lm3s_ethernet.c
/****************************************************************************
 * arch/arm/src/lm3s/lm3s_ethernet.c
 *
 *   Copyright (C) 2009-2010 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <spudmonkey@racsa.co.cr>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#if defined(CONFIG_NET) && defined(CONFIG_LM3S_ETHERNET)

#include <stdint.h>
#include <stdbool.h>
#include <time.h>
#include <string.h>
#include <debug.h>
#include <wdog.h>
#include <errno.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <arch/board/board.h>
#include <net/uip/uip.h>
#include <net/uip/uip-arp.h>
#include <net/uip/uip-arch.h>

#include "chip.h"
#include "up_arch.h"

#include "lm3s_internal.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Half duplex can be forced if CONFIG_LM3S_ETHHDUPLEX is defined. */

#ifdef CONFIG_LM3S_ETHHDUPLEX
#  define LM3S_DUPLEX_SETBITS 0
#  define LM3S_DUPLEX_CLRBITS MAC_TCTL_DUPLEX
#else 
#  define LM3S_DUPLEX_SETBITS MAC_TCTL_DUPLEX
#  define LM3S_DUPLEX_CLRBITS 0
#endif

/* Auto CRC generation can be suppressed if CONFIG_LM3S_ETHNOAUTOCRC is definde */

#ifdef CONFIG_LM3S_ETHNOAUTOCRC
#  define LM3S_CRC_SETBITS 0
#  define LM3S_CRC_CLRBITS MAC_TCTL_CRC
#else 
#  define LM3S_CRC_SETBITS MAC_TCTL_CRC
#  define LM3S_CRC_CLRBITS 0
#endif

/* Tx padding can be suppressed if CONFIG_LM3S_ETHNOPAD is defined */

#ifdef CONFIG_LM3S_ETHNOPAD
#  define LM3S_PADEN_SETBITS 0
#  define LM3S_PADEN_CLRBITS MAC_TCTL_PADEN
#else 
#  define LM3S_PADEN_SETBITS MAC_TCTL_PADEN
#  define LM3S_PADEN_CLRBITS 0
#endif

#define LM3S_TCTCL_SETBITS (LM3S_DUPLEX_SETBITS|LM3S_CRC_SETBITS|LM3S_PADEN_SETBITS)
#define LM3S_TCTCL_CLRBITS (LM3S_DUPLEX_CLRBITS|LM3S_CRC_CLRBITS|LM3S_PADEN_CLRBITS)

/* Multicast frames can be enabled by defining CONFIG_LM3S_MULTICAST */

#ifdef CONFIG_LM3S_MULTICAST
#  define LM3S_AMUL_SETBITS MAC_RCTL_AMUL
#  define LM3S_AMUL_CLRBITS 0
#else 
#  define LM3S_AMUL_SETBITS 0
#  define LM3S_AMUL_CLRBITS MAC_RCTL_AMUL
#endif

/* Promiscuous mode can be enabled by defining CONFIG_LM3S_PROMISCUOUS */

#ifdef CONFIG_LM3S_PROMISCUOUS
#  define LM3S_PRMS_SETBITS MAC_RCTL_PRMS
#  define LM3S_PRMS_CLRBITS 0
#else 
#  define LM3S_PRMS_SETBITS 0
#  define LM3S_PRMS_CLRBITS MAC_RCTL_PRMS
#endif

/* Bad CRC rejection can be enabled by define CONFIG_LM3S_BADCRC */

#ifdef CONFIG_LM3S_BADCRC
#  define LM3S_BADCRC_SETBITS MAC_RCTL_BADCRC
#  define LM3S_BADCRC_CLRBITS 0
#else 
#  define LM3S_BADCRC_SETBITS 0
#  define LM3S_BADCRC_CLRBITS MAC_RCTL_BADCRC
#endif

#define LM3S_RCTCL_SETBITS (LM3S_AMUL_SETBITS|LM3S_PRMS_SETBITS|LM3S_BADCRC_SETBITS)
#define LM3S_RCTCL_CLRBITS (LM3S_AMUL_CLRBITS|LM3S_PRMS_CLRBITS|LM3S_BADCRC_CLRBITS)

/* CONFIG_LM3S_DUMPPACKET will dump the contents of each packet to the console. */

#ifdef CONFIG_LM3S_DUMPPACKET
#  define lm3s_dumppacket(m,a,n) lib_dumpbuffer(m,a,n)
#else
#  define lm3s_dumppacket(m,a,n)
#endif

/* TX poll deley = 1 seconds. CLK_TCK is the number of clock ticks per second */

#define LM3S_WDDELAY   (1*CLK_TCK)
#define LM3S_POLLHSEC  (1*2)

/* TX timeout = 1 minute */

#define LM3S_TXTIMEOUT (60*CLK_TCK)

/* This is a helper pointer for accessing the contents of the Ethernet header */

#define ETHBUF ((struct uip_eth_hdr *)priv->ld_dev.d_buf)

#define LM32S_MAX_MDCCLK 2500000

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* EMAC statistics (debug only) */

#if defined(CONFIG_DEBUG) && defined(CONFIG_DEBUG_NET)
struct lm3s_statistics_s
{
  uint32_t rx_int;         /* Number of Rx interrupts received */
  uint32_t rx_packets;     /* Number of packets received (sum of the following): */
  uint32_t rx_ip;          /*   Number of Rx IP packets received */
  uint32_t rx_arp;         /*   Number of Rx ARP packets received */
  uint32_t rx_dropped;     /*   Number of dropped, unsupported Rx packets */
  uint32_t rx_pktsize;     /*   Number of dropped, too small or too big */
  uint32_t rx_errors;      /* Number of Rx errors (reception error) */
  uint32_t rx_ovrerrors;   /* Number of Rx FIFO overrun errors */
  uint32_t tx_int;         /* Number of Tx interrupts received */
  uint32_t tx_packets;     /* Number of Tx packets queued */
  uint32_t tx_errors;      /* Number of Tx errors (transmission error)*/
  uint32_t tx_timeouts;    /* Number of Tx timeout errors */
};
