PX4/PX4-Autopilot/nuttx/arch/arm/src/lm3s/lm3s_ethernet.c
#if defined(CONFIG_DEBUG) && defined(CONFIG_DEBUG_NET)
  if ((ris & MAC_RIS_TXER) != 0)
    {
      EMAC_STAT(priv, tx_errors);      /* Number of Tx errors */
    }

  if ((ris & MAC_RIS_FOV) != 0)
    {
      EMAC_STAT(priv, rx_ovrerrors);   /* Number of Rx FIFO overrun errors */
    }

  if ((ris & MAC_RIS_RXER) != 0)
    {
      EMAC_STAT(priv, rx_errors);      /* Number of Rx errors */
    }
#endif

  /* Handle (unmasked) interrupts according to status bit settings */

  ris &= lm3s_ethin(priv, LM3S_MAC_IM_OFFSET);

  /* Is this an Rx interrupt (meaning that a packet has been received)? */

  if ((ris & MAC_RIS_RXINT) != 0)
    {
      /* Handle the incoming packet */

      EMAC_STAT(priv, rx_int);
      lm3s_receive(priv);
    }

  /* Is this an Tx interrupt (meaning that the Tx FIFO is empty)? */

  if ((ris & MAC_RIS_TXEMP) != 0)
    {
       /* Handle the complete of the transmission */

      EMAC_STAT(priv, tx_int);
      lm3s_txdone(priv);
    }

  /* Enable Ethernet interrupts (perhaps excluding the TX done interrupt if 
   * there are no pending transmissions).
   */

  return OK;
}

/****************************************************************************
 * Function: lm3s_txtimeout
 *
 * Description:
 *   Our TX watchdog timed out.  Called from the timer interrupt handler.
 *   The last TX never completed.  Reset the hardware and start again.
 *
 * Parameters:
 *   argc - The number of available arguments
 *   arg  - The first argument
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static void lm3s_txtimeout(int argc, uint32_t arg, ...)
{
  struct lm3s_driver_s *priv = (struct lm3s_driver_s *)arg;

  /* Increment statistics */

  nlldbg("Tx timeout\n");
  EMAC_STAT(priv, tx_timeouts);

  /* Then reset the hardware */

  DEBUGASSERT(priv->ld_bifup);
  lm3s_ifdown(&priv->ld_dev);
  lm3s_ifup(&priv->ld_dev);

  /* Then poll uIP for new XMIT data */

  (void)uip_poll(&priv->ld_dev, lm3s_uiptxpoll);
}

/****************************************************************************
 * Function: lm3s_polltimer
 *
 * Description:
 *   Periodic timer handler.  Called from the timer interrupt handler.
 *
 * Parameters:
 *   argc - The number of available arguments
 *   arg  - The first argument
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static void lm3s_polltimer(int argc, uint32_t arg, ...)
{
  struct lm3s_driver_s *priv = (struct lm3s_driver_s *)arg;

  /* Check if we can send another Tx packet now.  The NEWTX bit initiates an
   * Ethernet transmission once the packet has been placed in the TX FIFO.
   * This bit is cleared once the transmission has been completed.
   *
   * NOTE: This can cause missing poll cycles and, hence, some timing
   * inaccuracies.
   */

  if ((lm3s_ethin(priv, LM3S_MAC_TR_OFFSET) & MAC_TR_NEWTX) == 0)
    {
      /* If so, update TCP timing states and poll uIP for new XMIT data */

      (void)uip_timer(&priv->ld_dev, lm3s_uiptxpoll, LM3S_POLLHSEC);

      /* Setup the watchdog poll timer again */

      (void)wd_start(priv->ld_txpoll, LM3S_WDDELAY, lm3s_polltimer, 1, arg);
    }
}

/****************************************************************************
 * Function: lm3s_ifup
 *
 * Description:
 *   NuttX Callback: Bring up the Ethernet interface when an IP address is
 *   provided 
 *
 * Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static int lm3s_ifup(struct uip_driver_s *dev)
{
  struct lm3s_driver_s *priv = (struct lm3s_driver_s *)dev->d_private;
  irqstate_t flags;
  uint32_t regval;
  uint32_t div;
  uint16_t phyreg;

  nlldbg("Bringing up: %d.%d.%d.%d\n",
       dev->d_ipaddr & 0xff, (dev->d_ipaddr >> 8) & 0xff,
       (dev->d_ipaddr >> 16) & 0xff, dev->d_ipaddr >> 24 );

  /* Enable and reset the Ethernet controller */

  flags = irqsave();
  lm3s_ethreset(priv);

  /* Set the management clock divider register for access to the PHY
   * register set. The MDC clock is divided down from the system clock per:
   *
   *   MDCCLK_FREQUENCY = SYSCLK_FREQUENCY / (2 * (div + 1))
   *   div = (SYSCLK_FREQUENCY / 2 / MDCCLK_FREQUENCY) - 1
   *
   * Where the maximum value for MDCCLK_FREQUENCY is 2,500,000.  We will
   * add 1 to assure the max LM32S_MAX_MDCCLK is not exceeded.
   */

  div = SYSCLK_FREQUENCY / 2 / LM32S_MAX_MDCCLK;
  lm3s_ethout(priv, LM3S_MAC_MDV_OFFSET, div);
  nllvdbg("MDV:   %08x\n", div);

  /* Then configure the Ethernet Controller for normal operation 
   *
   * Setup the transmit control register (Full duplex, TX CRC Auto Generation,
   * TX Padding Enabled).
   */

  regval  = lm3s_ethin(priv, LM3S_MAC_TCTL_OFFSET);
  regval &= ~LM3S_TCTCL_CLRBITS;
  regval |= LM3S_TCTCL_SETBITS;
  lm3s_ethout(priv, LM3S_MAC_TCTL_OFFSET, regval);
  nllvdbg("TCTL:  %08x\n", regval);

  /* Setup the receive control register (Disable multicast frames, disable
   * promiscuous mode, disable bad CRC rejection).
   */

  regval  = lm3s_ethin(priv, LM3S_MAC_RCTL_OFFSET);
  regval &= ~LM3S_RCTCL_CLRBITS;
  regval |= LM3S_RCTCL_SETBITS;
  lm3s_ethout(priv, LM3S_MAC_RCTL_OFFSET, regval);
  nllvdbg("RCTL:  %08x\n", regval);

  /* Setup the time stamp configuration register */

#ifdef LM3S_ETHTS
  regval = lm3s_ethin(priv, LM3S_MAC_TS_OFFSET);
#ifdef CONFIG_LM3S_TIMESTAMP
  regval |= MAC_TS_EN;
#else
  regval &= ~(MAC_TS_EN);
#endif
  lm3s_ethout(priv, LM3S_MAC_TS_OFFSET, regval);
  nllvdbg("TS:    %08x\n", regval);
#endif

  /* Wait for the link to come up.  This following is not very conservative
   * of system resources -- it really should wait gracefully on a semaphore
   * and the interrupt handler should post the semaphore when LINKSTATUS is
   * set
   */

  nlldbg("Waiting for link\n");
  do
    {
      phyreg = lm3s_phyread(priv, MII_MSR);
    }
  while ((phyreg & MII_MSR_LINKSTATUS) == 0);
  nlldbg("Link established\n");

  /* Reset the receive FIFO */

  regval  = lm3s_ethin(priv, LM3S_MAC_RCTL_OFFSET);
  regval |= MAC_RCTL_RSTFIFO;
  lm3s_ethout(priv, LM3S_MAC_RCTL_OFFSET, regval);

  /* Enable the Ethernet receiver */

  regval  = lm3s_ethin(priv, LM3S_MAC_RCTL_OFFSET);
  regval |= MAC_RCTL_RXEN;
  lm3s_ethout(priv, LM3S_MAC_RCTL_OFFSET, regval);

  /* Enable the Ethernet transmitter */

