PX4/PX4-Autopilot/nuttx/arch/arm/src/lm3s/lm3s_ethernet.c
  regval  = lm3s_ethin(priv, LM3S_MAC_TCTL_OFFSET);
  regval |= MAC_TCTL_TXEN;
  lm3s_ethout(priv, LM3S_MAC_TCTL_OFFSET, regval);

  /* Reset the receive FIFO (again) */

  regval  = lm3s_ethin(priv, LM3S_MAC_RCTL_OFFSET);
  regval |= MAC_RCTL_RSTFIFO;
  lm3s_ethout(priv, LM3S_MAC_RCTL_OFFSET, regval);

  /* Enable the Ethernet interrupt */

#if LM3S_NETHCONTROLLERS > 1
  up_enable_irq(priv->irq);
#else
  up_enable_irq(LM3S_IRQ_ETHCON);
#endif

  /* Enable the Ethernet RX packet receipt interrupt */

  regval = lm3s_ethin(priv, LM3S_MAC_IM_OFFSET);
  regval |= MAC_IM_RXINTM;
  lm3s_ethout(priv, LM3S_MAC_IM_OFFSET, regval);

  /* Program the hardware with it's MAC address (for filtering) */

  regval = (uint32_t)priv->ld_dev.d_mac.ether_addr_octet[3] << 24 |
           (uint32_t)priv->ld_dev.d_mac.ether_addr_octet[2] << 16 |
           (uint32_t)priv->ld_dev.d_mac.ether_addr_octet[1] << 8 |
           (uint32_t)priv->ld_dev.d_mac.ether_addr_octet[0];
  lm3s_ethout(priv, LM3S_MAC_IA0_OFFSET, regval);

  regval = (uint32_t)priv->ld_dev.d_mac.ether_addr_octet[5] << 8 |
           (uint32_t)priv->ld_dev.d_mac.ether_addr_octet[4];
  lm3s_ethout(priv, LM3S_MAC_IA1_OFFSET, regval);

  /* Set and activate a timer process */

  (void)wd_start(priv->ld_txpoll, LM3S_WDDELAY, lm3s_polltimer, 1, (uint32_t)priv);

  priv->ld_bifup = true;
  irqrestore(flags);
  return OK;
}

/****************************************************************************
 * Function: lm3s_ifdown
 *
 * Description:
 *   NuttX Callback: Stop the interface.  The only way to restore normal
 *   behavior is to call lm3s_ifup().
 *
 * Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static int lm3s_ifdown(struct uip_driver_s *dev)
{
  struct lm3s_driver_s *priv = (struct lm3s_driver_s *)dev->d_private;
  irqstate_t flags;
  uint32_t regval;

  nlldbg("Taking down: %d.%d.%d.%d\n",
       dev->d_ipaddr & 0xff, (dev->d_ipaddr >> 8) & 0xff,
       (dev->d_ipaddr >> 16) & 0xff, dev->d_ipaddr >> 24 );

  /* Cancel the TX poll timer and TX timeout timers */

  flags = irqsave();
  wd_cancel(priv->ld_txpoll);
  wd_cancel(priv->ld_txtimeout);

  /* Disable the Ethernet interrupt */

#if LM3S_NETHCONTROLLERS > 1
  up_disable_irq(priv->irq);
#else
  up_disable_irq(LM3S_IRQ_ETHCON);
#endif

  /* Disable all Ethernet controller interrupt sources */

  regval = lm3s_ethin(priv, LM3S_MAC_IM_OFFSET);
  regval &= ~MAC_IM_ALLINTS;
  lm3s_ethout(priv, LM3S_MAC_IM_OFFSET, regval);

  /* Reset the receive FIFO */

  regval  = lm3s_ethin(priv, LM3S_MAC_RCTL_OFFSET);
  regval |= MAC_RCTL_RSTFIFO;
  lm3s_ethout(priv, LM3S_MAC_RCTL_OFFSET, regval);

  /* Disable the Ethernet receiver */

  regval  = lm3s_ethin(priv, LM3S_MAC_RCTL_OFFSET);
  regval &= ~MAC_RCTL_RXEN;
  lm3s_ethout(priv, LM3S_MAC_RCTL_OFFSET, regval);

  /* Disable the Ethernet transmitter */

  regval  = lm3s_ethin(priv, LM3S_MAC_RCTL_OFFSET);
  regval &= ~MAC_TCTL_TXEN;
  lm3s_ethout(priv, LM3S_MAC_TCTL_OFFSET, regval);

  /* Reset the receive FIFO (again) */

  regval  = lm3s_ethin(priv, LM3S_MAC_RCTL_OFFSET);
  regval |= MAC_RCTL_RSTFIFO;
  lm3s_ethout(priv, LM3S_MAC_RCTL_OFFSET, regval);

  /* Clear any pending interrupts */

  regval = lm3s_ethin(priv, LM3S_MAC_RIS_OFFSET);
  lm3s_ethout(priv, LM3S_MAC_IACK_OFFSET, regval);

  /* The interface is now DOWN */

  priv->ld_bifup = false;
  irqrestore(flags);
  return OK;
}

/****************************************************************************
 * Function: lm3s_txavail
 *
 * Description:
 *   Driver callback invoked when new TX data is available.  This is a 
 *   stimulus perform an out-of-cycle poll and, thereby, reduce the TX
 *   latency.
 *
 * Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called in normal user mode
 *
 ****************************************************************************/

static int lm3s_txavail(struct uip_driver_s *dev)
{
  struct lm3s_driver_s *priv = (struct lm3s_driver_s *)dev->d_private;
  irqstate_t flags;

  /* Ignore the notification if the interface is not yet up or if the Tx FIFO
   * hardware is not available at this time.  The NEWTX bit initiates an
   * Ethernet transmission once the packet has been placed in the TX FIFO.
   * This bit is cleared once the transmission has been completed.  When the
   * transmission completes, lm3s_txdone() will be called and the Tx polling
   * will occur at that time.
   */

  flags = irqsave();
  if (priv->ld_bifup && (lm3s_ethin(priv, LM3S_MAC_TR_OFFSET) & MAC_TR_NEWTX) == 0)
    {
      /* If the interface is up and we can use the Tx FIFO, then poll uIP
       * for new Tx data
       */

      (void)uip_poll(&priv->ld_dev, lm3s_uiptxpoll);
    }

  irqrestore(flags);
  return OK;
}

/****************************************************************************
 * Function: lm3s_addmac
 *
 * Description:
 *   NuttX Callback: Add the specified MAC address to the hardware multicast
 *   address filtering
 *
 * Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *   mac  - The MAC address to be added 
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

#ifdef CONFIG_NET_IGMP
static int lm3s_addmac(struct uip_driver_s *dev, FAR const uint8_t *mac)
{
  FAR struct lm3s_driver_s *priv = (FAR struct lm3s_driver_s *)dev->d_private;

  /* Add the MAC address to the hardware multicast routing table */

#warning "Multicast MAC support not implemented"
  return OK;
}
#endif

/****************************************************************************
 * Function: lm3s_rmmac
 *
 * Description:
 *   NuttX Callback: Remove the specified MAC address from the hardware multicast
 *   address filtering
 *
 * Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *   mac  - The MAC address to be removed 
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

