PX4/PX4-Autopilot/nuttx/arch/arm/src/lm3s/lm3s_ethernet.c
#ifdef CONFIG_NET_IGMP
static int lm3s_rmmac(struct uip_driver_s *dev, FAR const uint8_t *mac)
{
  FAR struct lm3s_driver_s *priv = (FAR struct lm3s_driver_s *)dev->d_private;

  /* Add the MAC address to the hardware multicast routing table */

#warning "Multicast MAC support not implemented"
  return OK;
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Function: lm3s_ethinitialize
 *
 * Description:
 *   Initialize the Ethernet driver for one interface
 *
 * Parameters:
 *   None
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

#if LM3S_NETHCONTROLLERS > 1
int lm3s_ethinitialize(int intf)
#else
static inline int lm3s_ethinitialize(int intf)
#endif
{
  struct lm3s_driver_s *priv = &g_lm3sdev[intf];
  int ret;

  /* Check if the Ethernet module is present */

  ndbg("Setting up eth%d\n", intf);

#if LM3S_NETHCONTROLLERS > 1
# error "This debug check only works with one interface"
#else
  DEBUGASSERT((getreg32(LM3S_SYSCON_DC4) & (SYSCON_DC4_EMAC0|SYSCON_DC4_EPHY0)) == (SYSCON_DC4_EMAC0|SYSCON_DC4_EPHY0));
#endif
  DEBUGASSERT((unsigned)intf < LM3S_NETHCONTROLLERS);

  /* Initialize the driver structure */

  memset(priv, 0, sizeof(struct lm3s_driver_s));
  priv->ld_dev.d_ifup    = lm3s_ifup;     /* I/F down callback */
  priv->ld_dev.d_ifdown  = lm3s_ifdown;   /* I/F up (new IP address) callback */
  priv->ld_dev.d_txavail = lm3s_txavail;  /* New TX data callback */
#ifdef CONFIG_NET_IGMP
  priv->ld_dev.d_addmac  = lm3s_addmac;   /* Add multicast MAC address */
  priv->ld_dev.d_rmmac   = lm3s_rmmac;    /* Remove multicast MAC address */
#endif
  priv->ld_dev.d_private = (void*)priv;   /* Used to recover private state from dev */

  /* Create a watchdog for timing polling for and timing of transmisstions */

#if LM3S_NETHCONTROLLERS > 1
# error "A mechanism to associate base address an IRQ with an interface is needed"
  priv->ld_base          = ??;            /* Ethernet controller base address */
  priv->ld_irq           = ??;            /* Ethernet controller IRQ number */
#endif
  priv->ld_txpoll        = wd_create();   /* Create periodic poll timer */
  priv->ld_txtimeout     = wd_create();   /* Create TX timeout timer */

  /* If the board can provide us with a MAC address, get the address
   * from the board now.  The MAC will not be applied until lm3s_ifup()
   * is caleld (and the MAC can be overwritten with a netdev ioctl call). 
   */

#ifdef CONFIG_LM3S_BOARDMAC
   lm3s_ethernetmac(&priv->ld_dev.d_mac);
#endif

  /* Perform minimal, one-time initialization -- just reset the controller and
   * leave it disabled.  The Ethernet controller will be reset and properly
   * re-initialized each time lm3s_ifup() is called.
   */

  lm3s_ethreset(priv);
  lm3s_ifdown(&priv->ld_dev);

  /* Attach the IRQ to the driver */

#if LM3S_NETHCONTROLLERS > 1
  ret = irq_attach(priv->irq, lm3s_interrupt);
#else
  ret = irq_attach(LM3S_IRQ_ETHCON, lm3s_interrupt);
#endif
  if (ret != 0)
    {
      /* We could not attach the ISR to the IRQ */

      return -EAGAIN;
    }

  /* Register the device with the OS so that socket IOCTLs can be performed */

  (void)netdev_register(&priv->ld_dev);
  return OK;
}


/************************************************************************************
 * Name: up_netinitialize
 *
 * Description:
 *   Initialize the first network interface.  If there are more than one interface
 *   in the chip, then board-specific logic will have to provide this function to
 *   determine which, if any, Ethernet controllers should be initialized.
 *
 ************************************************************************************/

#if LM3S_NETHCONTROLLERS == 1
void up_netinitialize(void)
{
  (void)lm3s_ethinitialize(0);
}
#endif

#endif /* CONFIG_NET && CONFIG_LM3S_ETHERNET */

